#+STARTUP: overview
#+AUTHOR: Kinney
* 索引
  + [[未来记录]]
  + [[月度记录]]
  + [[每日记录]]
  + 跟踪记录
    + [[运动记录]]
    + [[睡眠记录]]
  + 读书笔记
    + [[《子弹笔记》]]
  + 清单列表
    + [[阅读清单]]
    + [[购买清单]]
  + [[毕业设计]] 
    
* 未来记录
  ● 实现bujo-mode

* 月度记录
** 2月
   | Date  | 日历页          | 任务页           |
   |-------+-----------------+------------------|
   | 1 五  | 高三同学聚餐    | > [[*Feb 12 Tue][毕设网站框架]]   |
   | 2 六  |                 | ● 使用bujo.org   |
   | 3 日  |                 | ● 学习Vue.js     |
   | 4 一  |                 | ● 学习emacs lisp |
   | 5 二  | 春节            | > [[*Feb 12 Tue][设计bujo-mode]] |
   | 6 三  |                 |                  |
   | 7 四  |                 |                  |
   | 8 五  |                 |                  |
   | 9 六  |                 |                  |
   | 10 日 | bujo结合orgmode |                  |
   | 11 一 |                 |                  |
   | 12 二 |                 |                  |
   | 13 三 |                 |                  |
   | 14 四 |                 |                  |
   | 15 五 |                 |                  |
   | 16 六 |                 |                  |
   | 17 日 |                 |                  |
   | 18 一 |                 |                  |
   | 19 二 |                 |                  |
   | 20 三 |                 |                  |
   | 21 四 |                 |                  |
   | 22 五 |                 |                  |
   | 23 六 |                 |                  |
   | 24 日 | 开学            |                  |
   | 25 一 |                 |                  |
   | 26 二 |                 |                  |
   | 27 三 |                 |                  |
   | 28 四 |                 |                  |

* 每日记录
** 2月
*** Feb 10 Sun
    × 学习bujo
       × 整理bujo笔记
       × 摘录bujo好句
    × bujo结合orgmode

*** Feb 11 Mon
     > 整理《子弹笔记》“实践”章节笔记
     > [[毕业设计][运用bootstrap搭建毕设框架]]
     × 完善bujo.org细节
	× 使用org-pomodoro
	× 完善内部链接跳转
	× 思考其他bujo与org的结合
	× 取消orgmode的代码缩进设置
     > org与omnifocus结合
     > 设计bujo-mode
     > 定期备份bujo.org

     - 事情复杂到一定程度时，单独形成一个集子
     - 专业性的笔记不记录在bujo中
     - 每天精力有限，把最好的精力用在最重要的事情上

*** Feb 12 Tue
    :LOGBOOK:
    CLOCK: [2019-02-12 Tue 11:34]--[2019-02-12 Tue 11:42] =>  0:08
    CLOCK: [2019-02-12 Tue 11:05]--[2019-02-12 Tue 11:07] =>  0:02
    :END:
    ● 整理《子弹笔记》“实践”章节笔记
    ● org与omnifocus结合
    ● org mode绘图
    × 定期备份bujo.org
    > [[毕业设计][学习Vue.js]]
    > [[设计bujo-mode]]
    < [[未来记录][实现bujo-mode]]

    - 记录daily log时考察三部分：脑中所想，昨日记录，月度记录

* 清单列表
** 阅读清单
   × 月亮与六便士
   ● 子弹笔记

** 购买清单
   ● 录音设备
   ● Mac mini+显示屏

* 读书笔记
** 《子弹笔记》
   :LOGBOOK:
   CLOCK: [2019-02-11 Mon 22:20]--[2019-02-11 Mon 22:24] =>  0:04
   :END:
   #+NAME: 《子弹笔记》
   * 理论
     - 子弹短句分为三类：任务(Task，需要做的事情), 事件(Event，你的经历), 笔记(Note，不想遗忘的信息)
     - 任务子弹分类：任务(●), 完成的任务(x), 迁移的任务(>), 计划中的任务(<), 不想关的任务(+划去+)
     - 事件子弹：用“○”表示，简明客观的记录即将发生或已经发生的事件，方便日后回顾与解决问题
     - 笔记子弹：用“-”表示，当某件事情有重要或有趣的细节值得记录时使用
     - 优先符号：用“★”表示，用于标注重要的子弹短句，常于任务子弹搭配
     - 灵感符号：用"!"标注笔记子弹，表明这条笔记让我产生了想法，思考或见解，供后续整理
     - 集子：模块化的集子解决混乱。子弹笔记的四个核心集子：每日记录，月度记录，未来记录，索引
     - 每日记录：快速记录一天的任务，事件，笔记，让思想减负
     - 月度记录：分为日历页和任务页，日历页是事件发生的时间轴，任务页梳脑中所有思绪
     - 未来记录：每日记录中有未来之事迁移到未来记录中，月度记录的时候查看未来记录进行迁移
     - 月度迁移：回顾上月任务未完成情况，分成4中情况：1.舍弃 2.重新抄写 3.迁移到个性化集子 4.迁移到未来记录
     - 年度迁移：回顾上一年的未完成情况，考察迁移那些项目，集子
   * 实践
     + 

   * 好句摘录
     - 如果生活是大海，那么其中的每一天就像海浪一样，有的震撼，有的普通。子弹笔记就像海岸，在每一天的影响下得到雕琢。
     - 若没能把想法积极的运用到生活中，就算是最强烈的信仰，最有益的经验也会消散。

* 跟踪记录
** 运动记录
** 睡眠记录
    - 睡眠时常达到8个小时为合格
    - 建议的起床时间为7:00，睡觉时间为23:00
*** Feb
    | Date | Get-up | Sleep | Len |
    |------+--------+-------+-----|
    |    1 |        |       |     |
    |    2 |        |       |     |
    |    3 |        |       |     |
    |    4 |        |       |     |
    |    5 |        |       |     |
    |    6 |        |       |     |
    |    7 |        |       |     |
    |    8 |        |       |     |
    |    9 |        |       |     |
    |   10 |   9:00 | 00:30 | 9h  |
    |   11 |   9:30 | 01:30 | 9h  |
    |   12 |  10:30 |       |     |
    |   13 |        |       |     |
    |   14 |        |       |     |
    |   15 |        |       |     |
    |   16 |        |       |     |
    |   17 |        |       |     |
    |   18 |        |       |     |
    |   19 |        |       |     |
    |   20 |        |       |     |
    |   21 |        |       |     |
    |   22 |        |       |     |
    |   23 |        |       |     |
    |   24 |        |       |     |
    |   25 |        |       |     |
    |   26 |        |       |     |
    |   27 |        |       |     |
    |   28 |        |       |     |
* 毕业设计
  ● 毕设网站框架
     - 使用Vue.js前端框架
     - 使用Django做服务器框架
  ● 数据库设计
     - 使用mysql
  ● 开题报告
  ● 查找文献资料

* 设计bujo-mode
  :LOGBOOK:
  CLOCK: [2019-02-12 Tue 12:26]--[2019-02-12 Tue 13:38] =>  1:12
  CLOCK: [2019-02-12 Tue 11:47]--[2019-02-12 Tue 12:20] =>  0:33
  :END:
  - bujo-agenda
     - F:bujo-agenda-future-view 未来记录(Future Log)
     - M:bujo-agenda-month-view 月度记录(Monthly Log)
     - D:bujo-agenda-ady-view 每日记录(Daily Log)
     - a:bujo-agenda-task-abort
     - d:bujo-agenda-task-done => × (done)
     - m:bujo-agenda-task-migrated => > (migrated)
       - task状态变为“>”
       - 选择要迁移到的日期或新集子
     - s:bujo-agenda-task-sheculed => < (schedule)
       - task状态变为“<”
       - 在未来记录中添加该task
     - n:bujo-agenda-next-line
     - p:bujo-agenda-previous-line
     - f:bujo-agenda-later
     - b:bujo-agenda-earlier
     - .:bujo-agenda-goto-today
     - j:bujo-agenda-goto-date
     - r:bujo-agenda-refresh
     - Tab bujo-agenda-goto
     - q:bujo-agenda-quit
     - x:bujo-agenda-exit
  - bujo-agenda-file
     - 自动生成特定格式的bujo.org
     - 解析bujo.org, 实现bujo.org和bujo agenda的双向动态更新
  - bujo-select
     - keybinding: C-c b
       | Select a capture template |
       |---------------------------|
       | [t]  Task                 |
       | [e]  Event                |
       | [n]  Note                 |
  - point
     - bujo-select选择t的时候将窗口分成左右两列，左边默认为bujo-agenda，显示昨天的记录，方便迁移
     - 只有task状态可变。自动对task的状态进行排序，依次为：todo-migrated-scheduled-done-abort，r刷新
     - bujo-agenda打开的默认展示为当天的Daily Log，分为三类：task, event, note
       - n, p上下移动；task可改变状态：t(todo), m(migrate), s(scheduled), d(done), a(abort)
       - f, b向前向后切换记录，“.”回到当天记录，j调用日历跳转到指定日期的日记录
     - 按键M显示月度记录页，分三列
       | Date  | Event    | Task    |
       |-------+----------+---------|
       | 1 Wes | ○ thing1 | ● task1 |
       | 2 Thu | ○ thing2 | ● task2 |
       | 3 Fri | ○ thing3 |         |
       | 4 Sta |          |         |
       | 5 Sun |          |         |
       | ..... | .....    | .....   |
       - 同理n,p,f,b,.,j,t,m,s,d,a
     - 按键F显示未来记录, 简单的task列表
       
